banzai-rails/app/controllers/admin/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM `games`

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO `games` (`city`, `updated_at`, `starts_at`, `rounds`, `created_at`) VALUES('Stockholm', '2009-11-28 03:49:19', '2009-11-28 03:49:00', 2, '2009-11-28 03:49:19')

  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT * FROM `games` WHERE (`games`.`id` = 2)
UPDATE `games` SET `rounds` = 4, `updated_at` = '2009-11-28 03:50:01' WHERE `id` = 2