banzai-rails/app/controllers/admin_controller.rb

  def score
    @games = Game.find(:all, :conditions => {:has_started => true})
    @games.each do |game|
      chosen = User.chosen_for_game(game)
      if chosen.nil?
        #dont handle this properly right now, just render nothing with status 200
        render :nothing => true
      end

      locations_within_catching_distance = Location.find(:all, :origin => [chosen.latitude, chosen.longitude], :within => 0.2, :conditions => ["user_id != ?", chosen.id])
      players_within_catching_distance = locations_within_catching_distance.map{|loc| loc.user }.uniq

      if players_within_catching_distance == game.users.count - 1
        #chosen is caught, end round and start next
        #for now – just close the game and declare a winner
        game.update_attributes(:has_started => false)
        game.users.each do |user|
          Net::HTTP.post_form(URI.parse('http://mwl.labs.ericsson.net/mwlservice/resource/consent/revoke'),
                                        { 'applicationID'=>'BANZAI3',
                                          'devKey'=>'NmisMAlwJWM09jktLs9LkgriQxB6Gso1BoVSv6D6',
                                          'msisdn' => user.phonenumber})
        end
        #SEND SMS to winner to say that he won
      else
        #deal out points
        chosen_score = chosen.get_score_for_game(game)
        chosen_score.update_attributes(:score => chosen_score.score + 10)
---
SELECT * FROM `games` WHERE (`games`.`has_started` = 1)
SELECT * FROM `games` LIMIT 1
SELECT * FROM `locations` WHERE (`locations`.user_id = 2) ORDER BY locations.id DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `registrations` ON `users`.id = `registrations`.user_id WHERE (`users`.`chosen` = 1) AND ((`registrations`.game_id = 1)) LIMIT 1
SELECT count(*) AS count_all FROM `users` INNER JOIN `registrations` ON `users`.id = `registrations`.user_id WHERE ((`registrations`.game_id = 1))
UPDATE `scores` SET `score` = 0, `updated_at` = '2009-11-28 10:56:54' WHERE `id` = 1