banzai-rails/app/controllers/games_controller.rb

SELECT * FROM `games`
---
  def index
    @games = Game.all

SELECT * FROM `games` WHERE (`games`.`id` = 1)
---
  def show
    @game = Game.find(params[:id])

SELECT * FROM `games` WHERE (`games`.`id` = 1)
SELECT * FROM `games` LIMIT 1
SELECT `users`.id FROM `users` INNER JOIN `registrations` ON `users`.id = `registrations`.user_id WHERE (`users`.`id` = 1) AND ((`registrations`.game_id = 1)) LIMIT 1
---
  def register
    @game = Game.find(params[:id])
    if @game.users.include?(current_user)

SELECT * FROM `games` WHERE (`games`.`id` = 1)
SELECT `users`.* FROM `users` INNER JOIN `registrations` ON `users`.id = `registrations`.user_id WHERE ((`registrations`.game_id = 1))
---
  def players
    @game = Game.find(params[:id])
    results = []
    @game.users.each do |user|